-- 查詢所有學生信息

-- 查詢所有課程名稱及學分(投影和別名)

-- 查詢所有女學生的姓名和出生日期(篩選)

-- 查詢所有80後學生的姓名、性別和出生日期(篩選)

-- 查詢姓”楊“的學生姓名和性別(模糊)

-- 查詢姓”楊“名字兩個字的學生姓名和性別(模糊)

-- 查詢姓”楊“名字三個字的學生姓名和性別(模糊)

-- 查詢名字中有”不“字或“嫣”字的學生的姓名(模糊)

-- 查詢沒有錄入家庭住址的學生姓名(空值)

-- 查詢錄入了家庭住址的學生姓名(空值)

-- 查詢學生選課的所有日期(去重)

-- 查詢學生的家庭住址(去重)

-- 查詢男學生的姓名和生日按年齡從大到小排列(排序)

-- 查詢年齡最大的學生的出生日期(聚合函數)

-- 查詢年齡最小的學生的出生日期(聚合函數)

-- 查詢男女學生的人數(分組和聚合函數)

-- 查詢課程編號爲1111的課程的平均成績(篩選和聚合函數)

-- 查詢學號爲1001的學生所有課程的平均分(篩選和聚合函數)

-- 查詢每個學生的學號和平均成績(分組和聚合函數)

-- 查詢平均成績大於等於90分的學生的學號和平均成績

-- 查詢年齡最大的學生的姓名(子查詢)

-- 查詢年齡最大的學生姓名和年齡(子查詢+運算)

-- 查詢選了兩門以上的課程的學生姓名(子查詢/分組條件/集合運算)

-- 查詢學生姓名、課程名稱以及成績(連接查詢)

-- 查詢選課學生的姓名和平均成績(子查詢和連接查詢)

-- 查詢每個學生的姓名和選課數量(左外連接和子查詢)
